crypto-a/scadable-v5-test/sdkconfig.defaults
# Target: ESP32 classic
CONFIG_IDF_TARGET="esp32"

# Stay on default 2MB flash + default partition table since OTA is parked.
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="2MB"

# Main task stack — we serialize a fair bit of JSON.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Disable log color codes so the log sink sees plain text.
CONFIG_LOG_COLORS=n
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# HTTP client tunings — we POST to SCADABLE on heartbeat + log flush.
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n

# Smaller image.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
